Strogino/src/Catalogs/ШкалыПлановКонтрактов/ШкалыПлановКонтрактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШкалыПлановКонтрактов</name>
  <tabularSections>
    <name>Диапазоны</name>
    <attributes>
      <name>НижняяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Бюджет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Strogino/src/Catalogs/ШкалыПлановКонтрактов/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	НижниеГраницы = Новый Массив;
	Для Каждого СтрокаТЧ Из Диапазоны Цикл
		Если НижниеГраницы.Найти(СтрокаТЧ.НижняяГраница) <> Неопределено Тогда
			Сообщить("Для границы " + СтрокаТЧ.НижняяГраница + " уже указан бюджет плана.", СтатусСообщения.Важное);
			Отказ = Истина;
		Иначе
			НижниеГраницы.Добавить(СтрокаТЧ.НижняяГраница);
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры
